app/controllers/confessions_controller.rb

SELECT "confessions".* FROM "confessions"
---
  def index
    @confessions = Confession.all

SELECT "confessions".* FROM "confessions" WHERE "confessions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @confession = Confession.find(params[:id])

INSERT INTO "confessions" ("created_at", "item", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 21 Oct 2013 01:04:10 UTC +00:00], ["item", "Pumpkin Bagel"], ["updated_at", Mon, 21 Oct 2013 01:04:10 UTC +00:00], ["user_id", ""]]
---
  def create
    @confession = Confession.new(params[:confession])

    respond_to do |format|
      if @confession.save