app/controllers/payments_controller.rb

  def index
    @payments = Payment.all
---
SELECT "payments".* FROM "payments"

  def show
    @payment = Payment.find(params[:id])
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @payment = Payment.find(params[:id])
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @payment = Payment.new(params[:payment])

    respond_to do |format|
      if @payment.save_with_payment
---
INSERT INTO "payments" ("created_at", "email", "stripe_customer_token", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 31 Oct 2013 09:29:56 UTC +00:00], ["email", "lalala@lalala.com"], ["stripe_customer_token", "cus_2qzl1dPpp4VJVl"], ["updated_at", Thu, 31 Oct 2013 09:29:56 UTC +00:00]]